questions_scale = ["Я не чувствую себя несчастным", "Я чувствую себя несчастным",
             "Я все время несчастен и не могу освободиться от этого чувства", "Я настолько несчастен и опечален, что не могу этого вынести",
             "Думая о будущем, я не чувствую себя особенно разочарованным", "Думая о будущем, я чувствую себя разочарованным",
             "Я чувствую, что мне нечего ждать в будущем", "Я чувствую, что будущее безнадежно и ничего не изменится к лучшему",
             "Я не чувствую себя неудачником", "Я чувствую, что у меня было больше неудач, чем у большинства других людей",
             "Когда я оглядываюсь на прожитую жизнь, все, что я вижу, это череды неудач", "Я чувствую себя полным неудачником",
             "Я получаю столько же удовольствия от жизни, как и раньше", "Я не получаю столько же удовольствия от жизни, как и раньше",
             "Я не получаю настоящего удовлетворения от чего бы то ни было", "Я всем неудовлетворен, и мне все надоело",
             "Я не чувствую себя особенно виноватым", "Довольно часто я чувствую себя виноватым",
             "Почти всегда я чувствую себя виноватым", "Я чувствую себя виноватым все время",
             "Я не чувствую, что меня за что-то наказывают", "Я чувствую, что могу быть наказан за что-то",
             "Я ожидаю, что меня накажут", "Я чувствую, что меня наказывают за что-то", "Я не испытываю разочарование в себе",
             "Я разочарован в себе", "Я внушаю себе отвращение", "Я ненавижу себя", "У меня нет чувства, что я в чем-то хуже других",
             "Я самокритичен и признаю свои слабости и ошибки", "Я все время виню себя за свои ошибки",
             "Я виню себя за все плохое, что происходит", "У меня нет мыслей о том, чтобы покончить с собой",
             "У меня есть мысли о том, чтобы покончить с собой, но я этого не делаю", "Я хотел бы покончить жизнь самоубийством",
             "Я бы покончил с собой, если бы представился удобный случай", "Я плачу не больше, чем обычно",
             "Сейчас я плачу больше обычного", "Я теперь все время плачу", "Раньше я еще мог плакать, но теперь не смогу, даже если захочу",
             "Сейчас я не более раздражителен, чем обычно", "Я раздражаюсь легче, чем раньше, даже по пустякам","Сейчас я все время раздражен",
             "Меня уже ничто не раздражает, потому что все стало безразлично",
             "Я не потерял интереса к другим людям", "У меня меньше интереса к другим людям, чем раньше",
             "Я почти утратил интерес к другим людям", "Я потерял всякий интерес к другим людям", "Я способен принимать решения так же, как всегда",
             "Я откладываю принятие решений чаще, чем обычно", "Я испытываю больше трудностей в принятии решений, чем прежде",
             "Я больше не могу принимать каких-либо решений", "Я не чувствую, что я выгляжу хуже, чем обычно",
             "Я обеспокоен, что выгляжу постаревшим и непривлекательным", "Я чувствую, что изменения, происходящие в моей внешности,"
             "сделали меня непривлекательным", "Я уверен, что выгляжу безобразным", "Я могу работать так же, как раньше",
             "Мне надо приложить дополнительные усилия, чтобы начать что-либо делать","Я с большим трудом заставляю себя что-либо сделать",
             "Я вообще не могу работать","Я могу спать так же хорошо, как и обычно",
             "Я сплю не так хорошо, как всегда", "Я просыпаюсь на 1-2 часа раньше, чем обычно и с трудом могу заснуть снова",
             "Я просыпаюсь на несколько часов раньше обычного и не могу снова заснуть", "Я устаю не больше обычного",
             "Я устаю легче обычного", "Я устаю почти от всего того, что делаю", "Я слишком устал, чтобы делать что бы то ни было",
             "Мой аппетит не хуже, чем обычно", "У меня не такой хороший аппетит, как был раньше", "Сейчас мой аппетит стал намного хуже",
             "Я вообще потерял аппетит", "Если в последнее время я и потерял в весе, то очень немного", "Я потерял в весе более 2 кг",
             "Я потерял в весе более 4 кг", "Я потерял в весе более 6 кг", "Я беспокоюсь о своем здоровье не больше, чем обычно",
             "Меня беспокоят такие проблемы, как различные боли, расстройства желудка, запоры",
             "Я настолько обеспокоен своим здоровьем, что мне даже трудно думать о чем-нибудь другом",
             "Я до такой степени обеспокоен своим здоровьем, что вообще ни о чем не могу думать",
             "Я не замечал каких-либо изменений в моих сексуальных интересах", "Я меньше, чем обычно интересуюсь сексом",
             "Сейчас я намного меньше интересуюсь сексом", "Я совершенно утратил интерес к сексу"]

results_scale = ["Менее 9 – отсутствие депрессивных симптомов, все в порядке", "Результат немного выше нормы, возможна легкая депрессия",
                 "19-29 – умеренная депрессия, рекомендуем обратиться к специалисту",
                 "30-63 – явно выраженная депрессивная симптоматика, необходима помощь специалиста"]

questions_anxiety = ["Затруднение на вдохе, нехватка воздуха или учащенное дыхание", "Ощущение удушья или комка в горле",
                     "Сердце скачет, колотится, готово выскочить из груди", "Загрудинная боль, неприятное чувство сдавления в груди",
                     "Профузная потливость (пот градом)", "Слабость, приступы дурноты, головокружения", "Ватные, «не свои» ноги",
                     "Ощущение неустойчивости или потери равновесия", "Тошнота или неприятные ощущения в животе",
                     "Ощущение, что все окружающее становится странным, нереальным, туманным или отстраненным",
                     "Ощущение, что все плывет, находитесь вне тела", "Покалывание или онемение в разных частях тела",
                     "Приливы жара или озноба", "Дрожь (тремор)", "Страх смерти или чего-то ужасного",
                     "Страх сойти с ума, потерять самообладание", "Внезапные приступы тревоги, сопровождающиеся тремя или более из [ref=ref1][color=0000ff]вышеперечисленных признаков[/ref][/color], возникающие"
                     " непосредственно перед и при попадании в ситуацию, которая, по вашему опыту, может вызвать приступ",
                     "Внезапные неожиданные приступы тревоги, сопровождающиеся тремя или более из [ref=ref1][color=0000ff]вышеперечисленных признаков[/ref][/color], "
                     "возникающие по незначительным поводам или без повода (т. е. когда вы НЕ находитесь в ситуации, которая, по вашему "
                     "опыту, может вызвать приступ)", "Внезапные неожиданные приступы, сопровождающиеся только одним или двумя из [ref=ref1][color=0000ff]вышеперечисленных признаков[/ref][/color], "
                     "возникающие по незначительным поводам или без повода (т. е. когда вы НЕ находитесь в ситуации, которая, по вашему "
                     "опыту, может вызвать приступ)", "Периоды тревоги, нарастающей по мере того, как вы готовитесь сделать что-то, что, по вашему опыту, может вызвать "
                     "тревогу, причем более сильную, чем та, которую в таких случаях испытывают большинство людей",
                     "Избегание пугающих вас ситуаций", " Состояние зависимости от других людей", "Напряженность и неспособность расслабиться",
                     "Тревога, «нервозность», беспокойство", "Приступы повышенной чувствительности к звуку, свету и прикосновению",
                     "Приступы поноса", "Чрезмерное беспокойство о собственном здоровье", "Ощущение усталости, слабости и повышенной истощаемости",
                     "Головные боли или боли в шее", "Трудности засыпания", "Просыпания среди ночи или беспокойный сон",
                     "Неожиданные периоды депрессии, возникающие по незначительным поводам или без повода",
                     "Перепады настроения и эмоций, которые в основном зависят от того, что происходит вокруг вас",
                     "Повторяющиеся и неотступные представления, мысли, импульсы или образы, которые вам кажутся тягостными, про"
                     "тивными, бессмысленными или отталкивающими", "Повторение одного и того же действия как ритуала. "
                     "Например, повторные перепроверки, перемывание и пересчет при отсутствии в этом необходимости"]

answer_anxiety = ["0 — нет", "1 — немного", "2 — умеренно", "3 — сильно", "4 — крайне сильно"]

result_anxiety = ["Можете не беспокоиться", "Клинически допустимый уровень тревоги", "Клинически значимый результат, "
                  "рекомандуется обратиться к специалисту", "Требуется срочная помощь специалиста"]

questions_asthenia = ["Я чувствую себя здоровым", "Физически я способен на немногое", "Я чувствую себя активным",
                      "Все, что я делаю, доставляет мне удовольствие", "Я чувствую себя усталым",
                      "Мне кажется, я многое успеваю за день", "Когда я занимаюсь чем-либо, я могу сконцентрироваться на этом",
                      "Физически я способен на многое", "Я боюсь дел, которые мне необходимо сделать",
                      "Я думаю, что за день выполняю очень мало дел", "Я могу хорошо концентрировать внимание",
                      "Я чувствую себя отдохнувшим", "Мне требуется много усилий для концентрации внимания",
                      "Физически я чувствую себя в плохом состоянии", "У меня много планов", "Я быстро устаю",
                      "Я очень мало успеваю сделать", "Мне кажется, что я ничего не делаю ", "Мои мысли легко рассеиваются",
                      "Физически я чувствую себя в прекрасном состоянии"]

answer_asthenia = ["Да, это правда", "Скорее да", "Не уверен", "Скорее нет", "Нет, это неправда"]

result_asthenia = ["Общей астении не выявлено", "Понижения активности не выявлено", "Снижения мотивации не выявлено",
                   "Физической астении не выявлено", "Психической астении не выявлено"]

result_asthenia_2 = ["Общая астения", "Понижение активности", "Снижение мотивации", "Физическая астения",
                     "Психическая астения", "Ваш результат может быть предварительным основанием "
                     "для постановки диагноза 'астенический синдром', рекомендуем обратиться к специалисту"]

scab_result = ["Результат значительно ниже среднего значения, ваша когнитивная гибкость недостаточно высока",
               "Результат ниже среднего, ваша когнитивная гибкость недостаточно высока",
               "Нормальный результат, ваша когнитивная гибкость на среднем уровне",
               "Хороший результат, ваша когнитивная гибкость на хорошем уровне",
               "Отличный результат, ваша когнитивная гибкость на довольно высоком уровне"]
